{"text": "A smart city deploys an AI system for traffic light optimization that includes a public dashboard explaining the system's purpose, data sources, and decision-making logic, with real-time updates on how AI adjustments impact traffic flow.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 by ensuring transparency through clear information about the AI's function and data usage, and Article 52 by implementing risk assessments and documentation for a high-risk public administration system. The dashboard enables user understanding and accountability.", "context": "smart city"}
{"text": "A customer service chatbot uses emotional recognition to detect user frustration and automatically tailors responses to de-escalate situations, but also subtly manipulates dialogue patterns to increase user engagement with upselling prompts.", "violation": "borderline", "category": "risk_management", "severity": "borderline", "articles": ["Article 4", "Article 5", "Article 9"], "explanation": "The system's use of emotional recognition for de-escalation could be seen as a legitimate customer service tool (Article 4), but its manipulation of dialogue patterns for upselling raises concerns about deception and exploitation (Article 5). Experts debate whether the intent to influence consumer behavior crosses into prohibited manipulative practices.", "context": "customer service", "ambiguity": true}
{"text": "An AI system used by an insurance company to assess health risk factors relies on outdated and incomplete medical data, leading to inaccurate risk evaluations and unfair premium calculations for specific demographic groups.", "violation": true, "category": "accuracy_robustness", "severity": "high", "articles": ["Article 15"], "explanation": "This violates Article 15 because the AI system lacks accuracy and robustness, resulting in biased and unreliable risk assessments that could harm policyholders and undermine trust in the insurance service.", "context": "insurance"}
{"text": "An e-commerce platform uses an AI system to analyze customer purchase history and browsing behavior without explicit consent, and fails to provide clear information about data usage, leading to unauthorized profiling and targeted advertising.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by processing personal data through an AI system without ensuring transparency, data subject rights, and proper governance, as required for high-risk data processing under the EU AI Act.", "context": "e-commerce"}
{"text": "A smart city AI system uses facial recognition cameras in public spaces to monitor citizens' behavior, automatically flagging individuals for 'non-compliance' with social norms (e.g., loitering, public displays of affection) and sharing this data with law enforcement without explicit consent or transparency.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by deploying prohibited practices involving real-time processing of biometric data for social scoring, and Article 7 by failing to conduct mandatory risk assessments, ensure transparency, and obtain valid consent for high-risk AI systems in public spaces.", "context": "smart city"}
{"text": "An AI system used by a recruitment agency that analyzes applicants' social media profiles to predict job performance without explicit consent, relying on unregulated personal data such as political views or religious beliefs.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by processing personal data without a lawful basis, failing to ensure transparency, and using sensitive data for purposes incompatible with data subjects' rights, thereby infringing on fundamental freedoms.", "context": "hiring"}
{"text": "A social media platform uses AI to generate personalized content recommendations and clearly labels all AI-generated posts with a visible 'AI-generated' watermark, while providing users with an accessible summary of how their data is used for AI processing.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 by ensuring transparency about AI use through clear labeling and data usage summaries, and Article 52 by implementing safeguards for data governance and user rights in AI-driven social media practices.", "context": "social media"}
{"text": "An e-commerce platform uses an AI system to automatically generate personalized product recommendations without maintaining records of the training data sources, algorithmic decision-making processes, or user impact assessments.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 by failing to implement required record-keeping for high-risk AI systems, which mandates documentation of development, deployment, and operational practices to ensure transparency and accountability.", "context": "e-commerce"}
{"text": "A legal research assistance AI tool that provides transparent, explainable recommendations on case law interpretation, with mandatory human lawyer review and data anonymization of all legal documents processed.", "violation": false, "category": "risk_management", "severity": "none", "articles": ["Article 9"], "explanation": "This complies with Article 9 by implementing transparency requirements, ensuring human oversight through mandatory lawyer review, and protecting personal data via anonymization. The system's limited impact on fundamental rights and its design for辅助 legal analysis rather than automated decision-making align with the risk management requirements for standard AI systems.", "context": "legal services"}
{"text": "A customer service chatbot that automatically generates responses without disclosing its AI nature, uses ambiguous language to mimic human agents, and prevents users from accessing human support without clear opt-out mechanisms.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 by failing to provide transparency about the AI's role and Article 52 by not enabling human oversight or data subject rights in a high-risk customer service context.", "context": "customer service"}
{"text": "An AI system used for resume screening that employs diverse, representative training data to minimize bias, includes human oversight for final hiring decisions, and undergoes regular third-party audits for accuracy and cybersecurity compliance.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring transparency in data governance, incorporating human oversight to mitigate risks of inaccurate or biased outcomes, and implementing cybersecurity measures to protect candidate data. The system's design avoids automated decision-making in critical hiring stages, aligning with the Act's requirements for robustness and accountability.", "context": "hiring"}
{"text": "A law enforcement agency uses an AI system to analyze crime statistics and allocate resources for community policing, with transparent reporting and human oversight to ensure decisions are based on verified data and do not infringe on individual rights.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This practice complies with Article 5 by avoiding prohibited AI practices such as social scoring, behavioral manipulation, or undermining democratic processes. The system supports lawful law enforcement activities while ensuring transparency, accountability, and respect for fundamental rights.", "context": "law enforcement"}
{"text": "A healthcare AI system used for diagnostic support that employs end-to-end encryption for patient data, undergoes regular security audits, and includes adversarial robustness testing to prevent manipulation of input data.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This system complies with Article 15 by implementing technical safeguards against unauthorized access, ensuring data integrity through encryption, and actively testing for vulnerabilities that could compromise its reliability in medical decision-making.", "context": "healthcare"}
{"text": "A manufacturing company uses an AI system to monitor equipment health, but the system lacks safeguards against adversarial inputs, allowing malicious actors to manipulate sensor data and induce false safety signals, risking equipment failure and worker injury.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical robustness and safety requirements. The AI system's vulnerability to manipulation undermines its reliability, creating significant risks to physical safety and operational integrity in manufacturing.", "context": "manufacturing"}
{"text": "An AI system in chemical manufacturing that uses historical data to predict and adjust temperature settings in real-time without a fallback mechanism for prediction failures, potentially leading to unsafe conditions if the predictions are incorrect.", "violation": "borderline", "category": "technical_robustness", "severity": "borderline", "articles": [5, 8, 16], "explanation": "Experts may disagree on whether the system's potential to cause safety risks (e.g., chemical leaks or explosions) qualifies as a high-risk application under the AI Act, and whether the lack of transparency and fallback mechanisms violates Articles 5 (safety) and 16 (transparency).", "context": "manufacturing", "ambiguity": true}
{"text": "An AI system used by a recruitment agency automatically screens job applications and rejects candidates based on keywords in their resumes, without allowing human review or providing explanations for its decisions.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because it employs automated decision-making in employment without human oversight or transparency, potentially perpetuating discrimination and limiting candidates' right to contest decisions. The lack of explainability and accountability meets the criteria for high-risk AI systems under the Act.", "context": "hiring"}
{"text": "A healthcare AI system designed to assist radiologists in detecting lung cancer from CT scans, using anonymized patient data from approved medical databases. The system provides clear explanations for its diagnostic suggestions and allows clinicians to override AI recommendations.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This system complies with Article 6 by ensuring transparency through explainable AI outputs and user control. Article 7 is satisfied through lawful data governance: anonymized data from approved sources, secure storage, and strict access controls. Human oversight ensures alignment with clinical judgment.", "context": "healthcare"}
{"text": "A predictive maintenance AI system for public transportation vehicles that uses sensor data from onboard equipment to forecast mechanical failures, ensuring data is collected with explicit user consent, anonymized, and stored securely with regular audits for accuracy and compliance.", "violation": false, "category": "data_governance", "severity": "none", "articles": ["Article 10"], "explanation": "This complies with Article 10 by ensuring transparency in data collection practices, maintaining data quality through regular audits, and implementing safeguards (e.g., anonymization) to protect personal data while enabling lawful use for transportation safety improvements.", "context": "transportation"}
{"text": "An AI system used in insurance for automated claims assessment that employs validated algorithms, undergoes regular testing, and has encryption and access controls to ensure data integrity and prevent unauthorized access.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This system complies with Article 15 by ensuring accuracy through rigorous algorithm validation and testing, robustness via error-handling mechanisms, and cybersecurity through encryption and access controls, thereby mitigating risks for insurance operations.", "context": "insurance"}
{"text": "A financial institution uses an AI system for credit risk assessment that maintains detailed logs of all data inputs, model parameters, and decision-making processes, with automated documentation of system behavior and human oversight reviews.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring transparent, traceable, and auditable record-keeping for high-risk AI systems. The logs enable monitoring of AI decisions, data provenance, and human intervention, fulfilling the Act's requirements for documentation and accountability.", "context": "finance"}
{"text": "A smart city AI system uses anonymized sensor data from public infrastructure (e.g., streetlights, parking meters) to optimize traffic flow and energy efficiency. Data subjects are informed of data collection via transparent signage and a city portal, with opt-out mechanisms for non-critical data usage.", "violation": false, "category": "data_governance", "severity": "none", "articles": ["Article 10"], "explanation": "This complies with Article 10 by ensuring lawful data processing through anonymization, transparency via clear communication, and user control via opt-out options. Data is limited to necessary purposes (traffic optimization) and does not involve sensitive personal information.", "context": "smart city"}
{"text": "An e-commerce platform uses an AI system to dynamically adjust product prices in real-time based on users' browsing behavior, purchase history, and location, without disclosing to customers that prices are algorithmically manipulated and not fixed.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 by failing to ensure transparency about the use of AI systems that significantly affect consumers' economic decisions. It also violates Article 52 because the AI practice constitutes a high-risk system for unfair commercial practices in e-commerce, undermining consumer trust and market fairness.", "context": "e-commerce"}
{"text": "A social media platform uses an AI algorithm to analyze users", "violation": true, "category": "data_governance", "severity": "none", "articles": [], "explanation": "", "context": "social media"}
{"text": "A predictive maintenance AI system in a manufacturing plant uses sensor data to forecast machinery failures. It provides clear user interfaces displaying the rationale behind predictions, data sources, and limitations, with documented decision-making logic accessible to operators and maintenance teams.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 by ensuring transparency through explainable AI outputs and Article 52 by maintaining data quality governance through documented data sources and validation processes. The system avoids high-risk classifications while fulfilling transparency obligations.", "context": "manufacturing"}
{"text": "A company uses an AI-driven resume screening tool that automatically filters out candidates with certain names or backgrounds without disclosing to applicants that AI is involved in the hiring process, and fails to maintain records of algorithmic decisions.", "violation": true, "category": "record_keeping", "severity": "critical", "articles": ["Article 12"], "explanation": "This violates Article 12 by lacking transparency in AI use and failing to keep records of automated decision-making, which is mandatory for high-risk AI systems in hiring. Applicants are not informed about AI involvement, and there is no documentation of how the system operates or its impact on candidates.", "context": "hiring"}
{"text": "A social media platform uses an AI algorithm to automatically prioritize and recommend content that manipulates user behavior, such as promoting emotionally charged posts to maximize engagement, without disclosing the AI's role in content curation or its impact on user decisions.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 by failing to ensure transparency about the AI's influence on user experience and Article 52 by deploying a high-risk AI system that undermines user autonomy and democratic processes through covert behavioral manipulation.", "context": "social media"}
{"text": "A law enforcement AI system uses anonymized public camera footage and historical crime data to identify patterns of criminal activity, with human oversight required for all high-risk decisions and transparent reporting mechanisms for data usage.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This complies with Article 5 by avoiding prohibited practices through anonymization of biometric data, mandatory human intervention for critical decisions, and transparency requirements. The system operates within permitted uses for law enforcement while minimizing risks to fundamental rights.", "context": "law enforcement"}
{"text": "A financial institution uses an AI-driven credit scoring system that relies on outdated and biased training data, leading to systematically higher rejection rates for loan applications from minority groups while approving high-risk applicants with poor credit histories.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure accuracy and robustness, as the AI system produces discriminatory outcomes and lacks mechanisms to detect adversarial inputs or data biases, undermining trust and fairness in financial decision-making.", "context": "finance"}
{"text": "An e-commerce platform uses an AI system to automatically generate personalized product recommendations for users without providing clear information about the data sources, algorithms, or decision-making criteria used in the recommendations.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 of the EU AI Act, which mandates transparency requirements for high-risk AI systems. The lack of clear information about the AI's data processing and decision-making undermines user autonomy and right to explanation, which are core principles of the Act.", "context": "e-commerce"}
{"text": "A customer service chatbot that explicitly informs users it is an AI system, collects only minimal necessary data (e.g., order numbers, basic contact details), allows users to opt out of data collection, and deletes interaction data after 30 days unless consent is given for longer retention.", "violation": false, "category": "data_governance", "severity": "none", "articles": ["Article 10"], "explanation": "This complies with Article 10 by ensuring transparency (users know it's an AI), data minimization (only essential data is collected), user control (opt-out options), and secure data handling (deletion after retention period). These practices align with the Act's data governance requirements to protect user rights and limit data risks.", "context": "customer service"}
{"text": "An AI system that uses natural language processing to analyze unstructured data (e.g., cover letters, social media profiles) alongside structured resume data to rank candidates for a managerial position, with minimal human intervention in the final scoring.", "violation": "borderline", "category": "human_oversight", "severity": "borderline", "articles": [8, 9, 17], "explanation": "The system's use of unstructured data blurs the line between permissible data processing and prohibited biased decision-making. While Article 8 (high-risk systems in employment) applies to hiring, the lack of explicit transparency requirements for unstructured data analysis (Article 9) and the limited human oversight (Article 17) create ambiguity about whether the system meets compliance thresholds.", "context": "hiring", "ambiguity": true}
{"text": "An AI-powered adaptive learning platform that provides personalized study recommendations to students, with clear transparency about data usage and human oversight mechanisms for educators.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This system complies with Article 6 by providing transparent information about its purpose, data processing, and decision-making logic. It complies with Article 7 by using lawful, secure, and anonymized student data while ensuring data minimization and allowing educators to review and override AI-generated recommendations.", "context": "education"}
{"text": "An insurance company uses an AI system to assess risk based on non-traditional data sources, such as social media activity and geographical location, to determine premium rates for property insurance.", "violation": "borderline", "category": "prohibited_practices", "severity": "borderline", "articles": ["Article 5", "Article 9"], "explanation": "This practice could be seen as indirect discrimination under Article 9 if the data correlates with protected characteristics (e.g., socioeconomic status), but may be considered a legitimate risk assessment under Article 5 if it's deemed necessary for a lawful purpose. The ambiguity lies in whether the data processing constitutes discrimination or a valid risk factor.", "context": "insurance", "ambiguity": true}
{"text": "A financial institution uses an AI-driven credit scoring system that automatically rejects loan applications without providing applicants with clear information about the AI's involvement, the criteria used for decision-making, or the option to request a human review.", "violation": true, "category": "transparency", "severity": "high", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 (transparency requirements) by failing to inform users of the AI's role and Article 52 (high-risk AI systems) by not ensuring explainability and human oversight in critical financial decisions. Applicants are denied recourse and cannot challenge decisions due to lack of transparency.", "context": "finance"}
{"text": "A customer service AI chatbot automatically denies refund requests without human intervention, using opaque criteria that are not disclosed to users.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency requirements) by failing to disclose AI decision-making processes and Article 29 (human oversight) by excluding human review for high-risk financial decisions. The lack of accountability mechanisms risks unfair treatment of consumers.", "context": "customer service"}
{"text": "A law firm uses an AI system to automate contract review, but the system is trained on biased historical data that disproportionately flags contracts from minority-owned businesses as high-risk, leading to unfair treatment and exclusion from legal opportunities.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 of the EU AI Act because the AI system fails to ensure data quality, accuracy, and fairness. The biased training data undermines technical robustness and safety, resulting in discriminatory outcomes that lack transparency and human oversight, which is required for high-risk AI systems in legal services.", "context": "legal services"}
{"text": "An insurance company uses an AI system to automatically approve or deny claims based on unvalidated historical data, without maintaining detailed technical documentation or conducting regular robustness tests.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical documentation, robustness, and safety requirements for high-risk AI systems. The lack of documentation and testing undermines transparency, accountability, and the system's reliability in critical insurance decision-making.", "context": "insurance"}
{"text": "A customer service chatbot that clearly discloses its AI nature to users, provides opt-out options for human agents, and includes a human oversight team that reviews 10% of interactions for bias or errors.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (transparency requirements) by informing users of the AI interaction and Article 29 (human oversight) by enabling human intervention and monitoring. The chatbot's design ensures accountability and allows for regular audits of AI decisions.", "context": "customer service"}
{"text": "A financial institution uses an AI system for automated loan approvals that does not disclose the criteria used for decision-making, lacks mechanisms for human intervention, and does not provide users with the ability to contest or correct decisions.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure transparency, human oversight, and the right to explanation, which are critical for trust and accountability in high-risk financial AI systems.", "context": "finance"}
{"text": "A legal research AI tool that assists lawyers in analyzing case law and regulations, with transparent algorithms, human oversight, and clear disclosure of its limitations and potential biases.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This system complies with Article 5 by avoiding prohibited practices such as manipulation, deception, or undermining the rule of law. It ensures transparency, allows human judgment to override AI recommendations, and explicitly discloses its capabilities and limitations to prevent misleading conclusions.", "context": "legal services"}
{"text": "A law enforcement agency deploys an AI system for predictive policing that automatically generates arrest warrants without human oversight, while not disclosing to citizens that AI is used to decide their freedom of movement.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 by failing to provide clear information about the AI's role in legal decisions, and Article 29 by excluding human oversight for high-risk law enforcement actions that directly impact fundamental rights. The lack of transparency and accountability creates significant risks to individual freedoms and due process.", "context": "law enforcement"}
{"text": "A computer vision AI system deployed in a manufacturing plant to inspect product quality uses anonymized sensor data and logs all data processing steps with timestamps, data sources, and decision rationale for each inspection outcome.", "violation": false, "category": "data_governance", "severity": "none", "articles": ["Article 10"], "explanation": "This complies with Article 10 by implementing robust data governance practices: data is anonymized to protect privacy, processing is fully documented for transparency, and decision-making logic is traceable. The system maintains data provenance and ensures accountability through audit logs.", "context": "manufacturing"}
{"text": "A school district deploys an AI-powered facial recognition system to monitor student attendance and behavior in classrooms, using biometric data to track individuals without parental consent or transparency.", "violation": true, "category": "risk_management", "severity": "high", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because it involves unambiguous processing of biometric data (facial recognition) for purposes other than explicitly allowed (e.g., law enforcement). The system lacks transparency, informed consent, and necessary safeguards, posing significant risks to fundamental rights and data privacy.", "context": "education"}
{"text": "An insurance company uses an AI system to automate claims processing but fails to maintain detailed records of the data sources, algorithmic decisions, and risk assessments used to determine claim payouts.", "violation": true, "category": "record_keeping", "severity": "critical", "articles": ["Article 12"], "explanation": "This violates Article 12 of the EU AI Act by lacking transparency and proper record-keeping, which prevents stakeholders from understanding how the AI system operates and makes decisions that directly impact policyholders' financial outcomes.", "context": "insurance"}
{"text": "A healthcare AI system used for diagnostic support provides patients with a clear, accessible explanation of how the AI arrives at its conclusions, including limitations and the role of human oversight in final decisions.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 by ensuring transparency about the AI's function and decision-making process, and Article 52 by implementing safeguards for high-risk healthcare applications through human-in-the-loop validation and clear user information.", "context": "healthcare"}
{"text": "A healthcare provider deploys an AI diagnostic tool that autonomously decides patient treatment plans without allowing qualified medical professionals to override or review decisions, and fails to disclose to patients that AI is involved in critical care decisions.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency requirements for users) by not informing patients about AI involvement and Article 29 (human oversight) by removing human capacity to intervene in treatment decisions. The lack of human oversight in critical healthcare decisions constitutes a high-risk AI system under the Act.", "context": "healthcare"}
{"text": "A customer service AI chatbot that uses anonymized customer data for training, with explicit user consent for data collection, transparent privacy policies, and regular security audits to ensure data protection.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring lawful data processing, transparency about data usage, and robust cybersecurity measures. Data is anonymized to minimize risks, and user consent is obtained, aligning with the Act's requirements for data governance and protection.", "context": "customer service"}
{"text": "A customer service AI chatbot that transparently identifies itself as an AI, provides clear information about its limitations, and allows customers to escalate complex issues to human agents. Human supervisors regularly review chatbot interactions for accuracy and compliance, with independent audits conducted quarterly.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (transparency requirements) by clearly disclosing the AI's nature and limitations, and Article 29 (human oversight) by enabling human intervention for complex cases and subjecting the system to regular audits. The low-risk nature of customer service interactions means no additional safeguards are required.", "context": "customer service"}
{"text": "An insurance company uses an AI system for automated underwriting that relies on outdated historical data without regular updates or validation, leading to incorrect risk assessments and unfair premium calculations.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical robustness and safety. The AI system does not account for new risk factors, unexpected data changes, or known vulnerabilities, posing significant risks to consumers and financial stability.", "context": "insurance"}
{"text": "An AI system used for automated student grading in schools does not maintain any records of the data processed, decision-making criteria, or outcomes of assessments.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 of the EU AI Act, which mandates that high-risk AI systems (like educational tools) must maintain detailed records of data processing activities, including inputs, processing logic, and outputs. The absence of such records compromises transparency, accountability, and the ability to audit or challenge AI-driven decisions affecting students.", "context": "education"}
{"text": "An e-commerce platform uses an AI system to automatically approve or deny refund requests without any human oversight, while not informing users that AI is involved in the decision-making process.", "violation": true, "category": "human_oversight", "severity": "high", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 by failing to provide transparency about the use of AI in critical user decisions and Article 29 by lacking human oversight for a high-risk AI system that impacts consumer rights and financial interests.", "context": "e-commerce"}
{"text": "An AI system used by a recruitment agency automatically filters job applications based on unexplained criteria, such as 'cultural fit' or 'potential for success,' without informing candidates that their data is being processed by an AI or disclosing the specific factors influencing the decision.", "violation": true, "category": "transparency", "severity": "high", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 (transparency requirements for high-risk AI systems) by failing to inform users about the AI's role and data processing, and Article 52 (information obligations) by not disclosing the use of AI in decision-making. Candidates cannot meaningfully consent or understand how their applications are evaluated, undermining their rights to transparency and fairness.", "context": "hiring"}
{"text": "A healthcare AI system that uses anonymized patient data to predict disease risks, with transparent algorithms, human oversight, and explicit consent mechanisms for data usage.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This complies with Article 5 by avoiding prohibited practices such as social scoring, biometric identification for control, or opaque decision-making. The system ensures transparency, human oversight, and data privacy, aligning with the Act's requirements for high-risk AI in healthcare.", "context": "healthcare"}
{"text": "A social media platform uses an AI content moderation system that incorrectly labels lawful political protests as 'hate speech', leading to widespread removal of legitimate user posts and suppression of free expression.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure accuracy and robustness in AI decision-making. The system's errors cause significant harm to users' rights and undermine trust in the platform's moderation processes.", "context": "social media"}
{"text": "An AI system used for autonomous train control fails to detect and respond to cybersecurity threats, allowing unauthorized remote access to override braking systems and cause derailments.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by lacking adequate cybersecurity measures to protect against malicious attacks, compromising the robustness and safety of the transportation system.", "context": "transportation"}
{"text": "A predictive maintenance AI system in a manufacturing plant that uses sensor data and machine learning to forecast equipment failures, enabling proactive maintenance scheduling while ensuring all decisions are logged and auditable by human operators.", "violation": false, "category": "risk_management", "severity": "none", "articles": ["Article 9"], "explanation": "This complies with Article 9 by integrating the AI system into a structured risk management framework. The system's decisions are transparent, auditable, and subject to human oversight, ensuring safety and accountability without creating undue risks. The AI's role is limited to supporting maintenance planning, which is classified as a low-risk activity under the EU AI Act.", "context": "manufacturing"}
{"text": "An AI system used by a recruitment agency automatically filters job applications based on keywords in resumes, without informing applicants of its use or providing explanations for rejections. The system disproportionately rejects candidates from certain demographic groups due to biased training data.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by failing to ensure transparency and provide meaningful information to applicants about the AI's role in the hiring process. It also violates Article 7 by employing a high-risk AI system that perpetuates discrimination through biased decision-making.", "context": "hiring"}
{"text": "An AI system used by a company to automatically screen job applicants' resumes and reject candidates based on unexplained criteria, without providing applicants with information about the AI's involvement or the ability to request a human review of the decision.", "violation": true, "category": "technical_robustness", "severity": "high", "articles": ["Article 15"], "explanation": "This violates Article 15 of the EU AI Act, which mandates transparency in AI systems and the right of users to obtain information about AI decisions. The lack of disclosure about AI use and absence of human oversight infringe on applicants' rights to understanding and contesting automated decisions.", "context": "hiring"}
{"text": "A customer service chatbot that uses biometric data (e.g., facial recognition) to identify users without explicit consent and does not disclose its AI nature to customers.", "violation": true, "category": "high_risk_systems", "severity": "high", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (transparency requirements for AI systems) by failing to inform users of the AI's presence and Article 7 (data governance) by processing biometric data without lawful consent, which is prohibited for high-risk AI systems.", "context": "customer service"}
{"text": "A financial institution uses an AI-driven credit scoring system that automatically approves or denies loan applications without providing applicants with clear explanations for the decision, and lacks a human oversight mechanism to review or challenge AI outcomes.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency requirements for AI systems) by failing to inform users of the decision logic, and Article 29 (human oversight) by excluding human intervention in critical financial decisions. The lack of transparency and accountability risks unfair treatment and undermines consumer rights in the financial sector.", "context": "finance"}
{"text": "A healthcare AI diagnostic support system that maintains detailed records of patient data inputs, system performance metrics, and user feedback, including documentation of data sources, algorithmic decisions, and incident reports.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring comprehensive record-keeping for high-risk AI systems. Records include data provenance, testing outcomes, user interactions, and incident analyses, enabling transparency, accountability, and post-deployment monitoring as required by the regulation.", "context": "healthcare"}
{"text": "A smart city traffic management AI system that relies on sensor data without fail-safes for sensor failures, leading to unpredictable traffic light patterns and increased accident risks.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical robustness and safety requirements, as the system lacks mechanisms to handle sensor malfunctions or cybersecurity threats, endangering public safety and undermining trust in critical infrastructure.", "context": "smart city"}
{"text": "A predictive maintenance AI system for public transportation infrastructure uses sensor data from train components to forecast mechanical failures. The system provides clear user interfaces displaying risk assessments, data sources, and decision-making logic to maintenance crews, and stores all operational data in encrypted, auditable logs with strict access controls.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This complies with Article 6 by ensuring transparency through informative interfaces and data source disclosures, and Article 7 by implementing robust data governance practices including encryption, access controls, and auditability for high-risk AI operations in transportation infrastructure management.", "context": "transportation"}
{"text": "An AI system used in legal aid allocation that systematically disadvantages lower-income individuals by using biased training data, leading to unequal distribution of resources.", "violation": true, "category": "prohibited_practices", "severity": "high", "articles": ["Article 5"], "explanation": "This violates Article 5 by perpetuating discrimination and unfair treatment, as the AI's decisions are based on biased data that disproportionately harms specific demographic groups, undermining equal access to justice.", "context": "legal services"}
{"text": "A smart city traffic management AI system uses real-time sensor data to optimize traffic light timing, incorporating redundant data sources, continuous monitoring for anomalies, and automated fallback protocols to ensure uninterrupted operation during system failures.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by implementing technical robustness through redundancy, anomaly detection, and fail-safe mechanisms. The system undergoes regular validation, maintains data quality checks, and includes human oversight for critical decisions, ensuring safety and reliability in a smart city environment.", "context": "smart city"}
{"text": "A smart city AI traffic management system fails to maintain detailed logs of algorithmic decisions, such as traffic light timing adjustments, and does not record incidents where AI interventions caused traffic congestion or safety risks.", "violation": true, "category": "record_keeping", "severity": "critical", "articles": ["Article 12"], "explanation": "This violates Article 12 by neglecting record-keeping obligations for high-risk AI systems, which require operators to document system behavior, decision-making processes, and incident reports to ensure accountability and transparency.", "context": "smart city"}
{"text": "A customer service AI chatbot that automatically generates and stores customer interaction records without explicit user consent or transparency about AI involvement", "violation": "borderline", "category": "record_keeping", "severity": "borderline", "articles": ["5", "8"], "explanation": "The system's data retention practices may trigger Article 5 (transparency requirements) and Article 8 (record-keeping obligations), but its classification as 'high-risk' under Article 5(2) depends on whether the automated decision-making significantly impacts users' rights, creating ambiguity about its regulatory scope", "context": "customer service", "ambiguity": true}
{"text": "A customer service AI chatbot that assigns users a 'trust score' based on their interaction history, payment behavior, and demographic data to determine the quality of support they receive.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 by using social scoring for creditworthiness and professional performance, which is prohibited under the EU AI Act. The AI system lacks transparency, risks discrimination, and could unfairly disadvantage certain groups, violating fundamental rights.", "context": "customer service"}
{"text": "A healthcare AI system used for diagnostic support provides patients with clear explanations of its recommendations, including the data sources, limitations, and potential errors, while ensuring human oversight for final decisions.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 (transparency requirements) by informing users about the AI's purpose, data usage, and decision-making process. It aligns with Article 52 (high-risk AI systems) by incorporating human oversight, risk assessments, and documentation to ensure safety and accountability in healthcare decisions.", "context": "healthcare"}
{"text": "A manufacturing company uses an AI-based facial recognition system to monitor employee attendance without explicit consent, processing biometric data to track workers' presence on the factory floor.", "violation": true, "category": "data_governance", "severity": "high", "articles": ["Article 10"], "explanation": "This violates Article 10 by processing biometric data for identification purposes without ensuring data quality, transparency, or safeguards against discrimination. The system lacks informed consent and fails to meet the legal requirements for data governance in high-risk AI applications.", "context": "manufacturing"}
{"text": "A customer service AI chatbot that automatically terminates user accounts without providing explanations or human intervention, based on vague criteria like 'repeated complaints' without clear definitions.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 by failing to ensure transparency, human oversight, and accountability in high-risk automated decision-making, potentially leading to unfair treatment and lack of redress for users.", "context": "customer service"}
{"text": "A smart city AI surveillance system uses facial recognition cameras in public spaces to monitor citizens' movements without explicit consent, retaining biometric data for indefinite periods without providing data subjects with access or deletion rights.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure transparency, data minimization, and data subject rights. The system processes sensitive biometric data without adequate safeguards, lacks mechanisms for individuals to access or delete their data, and retains information beyond necessary purposes.", "context": "smart city"}
{"text": "A law enforcement AI system uses unverified, outdated surveillance footage for facial recognition, stored in unencrypted databases, leading to inaccurate suspect identifications and cybersecurity risks.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure data accuracy, robustness, and cybersecurity. The system uses low-quality data, lacks encryption, and produces unreliable results, risking wrongful arrests and data breaches.", "context": "law enforcement"}
{"text": "A transparent AI tool used by legal professionals to analyze contract clauses for compliance with EU regulations, providing clear explanations for its findings and allowing users to override recommendations at any stage.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This AI system complies with Article 5 by avoiding manipulative or deceptive practices. It ensures transparency through explainable outputs, allows human oversight, and is designed to support legal professionals rather than influence decisions in a harmful or misleading manner.", "context": "legal services"}
{"text": "A smart city AI system automatically issues traffic fines using license plate recognition without allowing human review or explanation of its decisions.", "violation": true, "category": "human_oversight", "severity": "high", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 by lacking human oversight for high-risk AI systems and Article 29 by denying individuals the right to explanation for automated decisions, risking unfair penalties and eroding public trust.", "context": "smart city"}
{"text": "A company uses an AI system to screen job applications, maintaining detailed records of the system's development, data sources, risk assessments, and human oversight processes. These records include documentation of the AI's training data, bias mitigation measures, and audit trails of decisions made by the system.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring robust record-keeping for a high-risk AI system used in hiring. The records demonstrate transparency, accountability, and the implementation of safeguards to address risks such as bias and discrimination, as required by the EU AI Act.", "context": "hiring"}
{"text": "A real-time traffic management AI system using anonymized historical and sensor data to optimize traffic light timing, accompanied by clear user interfaces explaining algorithmic decisions and data sources.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This complies with Article 6 (transparency requirements) through explainable decision-making interfaces and Article 7 (data governance) via lawful data collection, anonymization, and secure processing of transportation data.", "context": "transportation"}
{"text": "A fleet management AI system for public transportation vehicles logs all operational data, including sensor inputs, maintenance history, and route performance metrics, while maintaining detailed documentation of algorithmic design, data sources, risk assessments, and mitigation measures.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring comprehensive record-keeping for AI systems in transportation, including documentation of system design, data governance, risk management processes, and operational transparency, which is mandatory for high-risk AI systems under the EU AI Act.", "context": "transportation"}
{"text": "An AI system used for resume screening that provides candidates with a clear explanation of its scoring criteria, includes regular bias audits, and requires human oversight for final hiring decisions.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring accuracy through transparent scoring criteria, robustness via regular bias audits, and cybersecurity through restricted access to candidate data. Human oversight mitigates risks of automated decision errors.", "context": "hiring"}
{"text": "A smart city deploys an AI system for real-time traffic light optimization using sensor data and machine learning, with mandatory human oversight, data anonymization, and public transparency about the system's operation and data usage.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This complies with Article 6 (high-risk AI systems requiring transparency, human oversight, and data governance) and Article 7 (transparency obligations for AI systems). The system includes risk assessments, human intervention capabilities, data anonymization to protect privacy, and clear communication to citizens about its purpose and functionality.", "context": "smart city"}
{"text": "A law enforcement agency deploys an AI system for facial recognition in public spaces that has a 30% false positive rate, leading to wrongful identification of innocent individuals and subsequent unjust detentions.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure the AI system's accuracy and robustness, risking significant harm to individuals' rights and undermining trust in law enforcement processes.", "context": "law enforcement"}
{"text": "An AI system used in automotive manufacturing for predictive maintenance fails to accurately predict equipment failures, leading to unexpected breakdowns. The system's documentation does not disclose its limited accuracy in detecting early-stage wear in critical components.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure transparency about the AI system's limitations and potential risks. The lack of disclosure about its inaccurate predictions compromises safety and operational reliability in high-risk manufacturing processes.", "context": "manufacturing"}
{"text": "An AI system used for resume screening employs an outdated machine learning model that is susceptible to adversarial attacks, allowing malicious actors to manipulate input data and bypass candidate quality checks.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical robustness and safety. The system lacks protections against attacks and errors, risking incorrect hiring decisions and compromising the integrity of the recruitment process.", "context": "hiring"}
{"text": "A healthcare AI diagnostic system used in hospitals fails to maintain detailed records of its training data, validation processes, and risk assessments as required by the EU AI Act.", "violation": true, "category": "record_keeping", "severity": "critical", "articles": ["Article 12"], "explanation": "The system violates Article 12 by not keeping documentation of data sources, training methodologies, and risk mitigation measures, which are mandatory for high-risk AI in healthcare. This lack of transparency undermines accountability and poses risks to patient safety.", "context": "healthcare"}
{"text": "An AI-powered platform that provides personalized learning recommendations based on student performance data, without influencing social behavior or reputation systems.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This system complies with Article 5 by avoiding prohibited practices such as social scoring, manipulation of human behavior, and real-time reputation systems. It focuses on non-discriminatory educational support while ensuring transparency and user autonomy.", "context": "education"}
{"text": "A financial institution uses an AI-driven credit scoring system that automatically approves or rejects loan applications without any human oversight or transparency mechanisms, leading to biased decision-making and lack of accountability.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency requirements) by not informing users about the AI's role in decisions and Article 29 (human oversight) by excluding humans from critical decision-making processes in a high-risk financial context. The lack of oversight risks discriminatory outcomes and undermines consumer rights.", "context": "finance"}
{"text": "A customer service AI chatbot uses facial recognition in video calls to automatically detect and label customers' emotional states (e.g., anger, sadness) without explicit consent, then tailors responses to suppress those emotions, while falsely claiming to be a human agent.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (transparency requirements for high-risk systems) by deceiving users about the AI's nature and Article 7 (data governance) by processing biometric data without lawful consent. The emotional manipulation constitutes social scoring and discrimination risks under high-risk categories.", "context": "customer service"}
{"text": "An AI-based traffic management system that uses real-time personal data from vehicle sensors to dynamically adjust traffic signals without user consent or transparency mechanisms.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by processing personal data in real-time without lawful basis or safeguards, and Article 7 by failing to implement required risk mitigation measures for high-risk transportation systems.", "context": "transportation"}
{"text": "An AI-driven student performance prediction tool that uses unconsented personal data (e.g., social media activity, attendance records) to label students as 'at-risk' without transparency or mechanisms for data subject access or correction.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by processing personal data without explicit consent, lacking transparency about data usage, and failing to respect data subjects' rights to access, rectify, or delete their data, thereby undermining fundamental rights and data governance principles.", "context": "education"}
{"text": "A smart city traffic management AI system uses real-time video analytics to detect traffic violations but fails to maintain logs of the data sources, algorithmic decisions, or human oversight interventions.", "violation": true, "category": "record_keeping", "severity": "critical", "articles": ["Article 12"], "explanation": "This violates Article 12 by lacking mandatory record-keeping requirements for AI systems, which undermines transparency, accountability, and the ability to audit decision-making processes in public infrastructure.", "context": "smart city"}
{"text": "An AI system used for diagnosing rare genetic disorders in pediatric patients, trained primarily on data from a single ethnic group, leading to a 40% higher error rate in underrepresented populations.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by deploying an AI system with unjustified risks to health due to biased training data, resulting in significant harm to patients from underrepresented groups through misdiagnosis and delayed treatment.", "context": "healthcare"}
{"text": "An AI system that analyzes candidates' social media profiles to assess 'cultural fit' during hiring, using indirect indicators like posting frequency, language use, and engagement patterns to predict job performance.", "violation": "borderline", "category": "record_keeping", "severity": "borderline", "articles": ["Article 5 (Biometric data processing)", "Article 8 (Profiling)"], "explanation": "The system's use of non-biometric personal data for hiring decisions may fall under Article 8 (profiling) if it creates a risk of discrimination, but its indirect nature and potential for non-discriminatory use (e.g., assessing communication skills) create ambiguity about whether it qualifies as high-risk or limited-risk under the Act.", "context": "hiring", "ambiguity": true}
{"text": "An e-commerce platform uses an AI-driven product recommendation system that manipulates user data through adversarial inputs to promote low-quality or counterfeit goods, bypassing cybersecurity safeguards.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure accuracy (promoting harmful products), robustness (lack of defense against adversarial attacks), and cybersecurity (exposing user data to exploitation). The AI’s design compromises consumer safety and trust.", "context": "e-commerce"}
{"text": "A financial institution uses an AI system to assess creditworthiness by analyzing non-traditional data sources such as social media activity and behavioral patterns to determine loan eligibility.", "violation": "borderline", "category": "high_risk_systems", "severity": "borderline", "articles": [], "explanation": "While credit scoring is explicitly listed as a high-risk application under Article 8, the use of non-traditional data introduces ambiguity regarding compliance with transparency (Article 14) and risk management (Article 5) requirements. Experts may debate whether the system", "context": "finance", "ambiguity": true}
{"text": "A social media platform uses AI-generated content to create personalized political advertisements without disclosing to users that the content was produced by an AI system, leading to potential misinformation and manipulation of public opinion.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 by failing to ensure transparency about AI-generated content, which is required to inform users of the AI's role. It also violates Article 52 because the AI system is a high-risk application that could significantly impact democratic processes and public trust.", "context": "social media"}
{"text": "A school district uses an AI-driven student performance prediction tool that automatically assigns grades without maintaining any logs or records of the algorithm's decision-making process, including data sources, bias audits, or transparency reports.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 of the EU AI Act because the AI system fails to implement required record-keeping obligations for high-risk systems. The lack of transparency and audit trails prevents accountability, undermines trust in educational assessments, and compromises the rights of students and educators to challenge decisions.", "context": "education"}
{"text": "A law enforcement agency deploys an AI system for real-time facial recognition in public spaces to identify suspects, but the system lacks transparency mechanisms, human oversight, and has not undergone a thorough risk assessment as required by the EU AI Act.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 because the AI system uses biometric data for law enforcement purposes without ensuring transparency, human oversight, or adequate risk management, which are mandatory safeguards under the Act for high-risk systems.", "context": "law enforcement"}
{"text": "An AI system used in a factory", "violation": true, "category": "accuracy_robustness", "severity": "none", "articles": [], "explanation": "This violates Article 15 by failing to ensure accuracy and robustness of the AI system. The system", "context": "manufacturing"}
{"text": "An AI system used in hiring that provides detailed explanations for candidate assessments, allows candidates to access and correct their personal data, and ensures data minimization by only using necessary information for role-specific evaluations.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This complies with Article 6 (transparency requirements) by explaining AI decisions and Article 7 (data governance) by ensuring lawful processing, data subject rights, and minimization of personal data. The system avoids high-risk criteria by focusing on role-relevant data and providing human oversight.", "context": "hiring"}
{"text": "An insurance company uses an AI system to assess risk scores for policyholders by analyzing non-essential personal data (e.g., social media activity) without explicit consent, leading to discriminatory premium rates.", "violation": true, "category": "data_governance", "severity": "high", "articles": ["Article 10"], "explanation": "This violates Article 10 by processing personal data without lawful basis, transparency, or safeguards against discrimination. The AI system fails to ensure data minimization, accuracy, and respect for data subjects' rights, potentially exacerbating biases in insurance pricing.", "context": "insurance"}
{"text": "An e-commerce platform uses an AI system to dynamically adjust product recommendations based on users' browsing behavior, but does not disclose that the recommendations are generated by AI or how user data is used to influence choices.", "violation": "borderline", "category": "transparency", "severity": "borderline", "articles": [5, 8], "explanation": "The system's transparency obligations depend on whether it is classified as a high-risk AI system under Article 5. Personalized recommendations in e-commerce are not explicitly listed as high-risk, but could be argued to involve indirect discrimination (Article 8) or manipulative practices. The lack of disclosure creates ambiguity about whether the system meets transparency requirements for high-risk or limited-risk categories.", "context": "e-commerce", "ambiguity": true}
{"text": "A social media platform uses an AI system to detect and flag harmful content (e.g., hate speech) while providing users with clear explanations of why content was flagged, allowing users to appeal decisions through human review. The AI is trained on anonymized user data, and data processing adheres to strict security and privacy protocols.", "violation": false, "category": "high_risk_systems", "severity": "none", "articles": ["Article 6", "Article 7"], "explanation": "This complies with Article 6 (transparency requirements for high-risk AI systems) by informing users about automated decisions and providing appeal mechanisms. It complies with Article 7 (data governance) by ensuring lawful, secure, and transparent data handling practices for user data used in AI training.", "context": "social media"}
{"text": "A smart city deploys AI-powered facial recognition cameras in public areas to monitor pedestrian movement, but fails to inform citizens about data collection, lacks transparency about data usage, and does not implement safeguards against misuse of biometric data.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (transparency requirements for high-risk AI systems) and Article 7 (data governance rules for high-risk systems) by failing to provide clear information to users, ensuring data minimization, and implementing appropriate safeguards for biometric data processing.", "context": "smart city"}
{"text": "A customer service AI chatbot that clearly states its AI nature at the start of each interaction, provides users with the ability to opt-out of data collection, and displays a transparent privacy policy explaining how user data is processed and stored.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 by ensuring users are informed about the AI's presence and data practices, and Article 52 by implementing lawful data governance through user consent mechanisms and data minimization.", "context": "customer service"}
{"text": "A law enforcement agency deploys an AI-powered facial recognition system in public spaces without providing individuals with clear information about its purpose, data collection methods, or the right to opt out, while also failing to conduct a thorough risk assessment for biases and errors.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (transparency obligations) by not informing individuals of the AI's use and Article 7 (risk management) by lacking a proper assessment of potential harms. The lack of transparency and risk mitigation undermines fundamental rights and public trust in law enforcement.", "context": "law enforcement"}
{"text": "An AI-driven resume screening tool that uses historical hiring data with gender and ethnic bias to automatically disqualify applicants based on names or addresses, disproportionately rejecting candidates from marginalized groups.", "violation": true, "category": "prohibited_practices", "severity": "high", "articles": ["Article 5"], "explanation": "This practice violates Article 5 by perpetuating discrimination and social exclusion through biased decision-making, as the AI system's design and training data reflect historical prejudices, leading to unfair disadvantages for protected groups in the hiring process.", "context": "hiring"}
{"text": "An AI system used in autonomous public transport vehicles that lacks transparency in its decision-making process, such as not disclosing how it prioritizes passenger safety over efficiency, and uses biased data to make route decisions.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by failing to ensure transparency and human oversight, and Article 7 by deploying an AI system that could lead to significant harm due to biased data processing and lack of accountability mechanisms.", "context": "transportation"}
{"text": "A law enforcement agency deploys a real-time facial recognition system in public spaces to monitor and track individuals without individualized suspicion, using AI to automatically flag and alert officers to 'suspected' persons based on biometric data.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act, which prohibits the use of biometric identification systems for law enforcement in high-risk scenarios unless they meet strict conditions like judicial oversight, transparency, and data minimization. The system lacks safeguards against mass surveillance and potential discrimination, infringing on fundamental rights.", "context": "law enforcement"}
{"text": "An AI system used by an insurance company to analyze aggregated, anonymized customer data (e.g., historical claims patterns) to set premium rates, with transparent decision-making processes and human oversight for final underwriting decisions.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This complies with Article 5 by avoiding prohibited practices such as real-time biometric data processing, social scoring, or manipulative behavior. The system uses non-sensitive data, ensures transparency, and includes human oversight to prevent discrimination and uphold data subject rights.", "context": "insurance"}
{"text": "An AI system used in a hospital to predict sepsis risk in patients by analyzing electronic health records (EHRs), lab results, and vital signs, but with limited transparency in its decision-making process and potential for false positives that could delay critical care.", "violation": "borderline", "category": "accuracy_robustness", "severity": "borderline", "articles": ["Article 5", "Article 8", "Article 17"], "explanation": "The system's use in healthcare for clinical decision support may trigger Article 5 (high-risk AI) due to potential harm from inaccurate predictions. However, its role as a supportive tool rather than a standalone diagnostic system creates ambiguity about whether it meets the 'high-risk' threshold. Additionally, the lack of transparency (Article 17) and potential cybersecurity vulnerabilities (Article 8) further complicate compliance assessments.", "context": "healthcare", "ambiguity": true}
{"text": "An AI system used by a recruitment platform automatically shortlists job candidates based on biased criteria (e.g., age, gender) without allowing human recruiters to override or review decisions, leading to discriminatory hiring outcomes.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (high-risk AI systems requiring human oversight) and Article 29 (transparency obligations) by lacking human oversight mechanisms and failing to disclose AI involvement in critical hiring decisions, risking discrimination and undermining workers' rights.", "context": "hiring"}
{"text": "An AI system used by a company to screen job applicants that systematically excludes candidates based on gender by analyzing resume keywords and past hiring data, which disproportionately favors male candidates for technical roles.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 of the EU AI Act because the AI system engages in discriminatory practices by reinforcing historical biases in hiring, leading to unfair disadvantage for certain gender groups and infringing on fundamental rights to non-discrimination and equality.", "context": "hiring"}
{"text": "A legal research AI system that uses explainable machine learning models to analyze case law and regulatory texts, with regular third-party audits for accuracy validation, encryption of all data transmissions, and role-based access controls to protect sensitive legal information.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring accuracy through validated training data and third-party audits, robustness via continuous testing against edge cases, and cybersecurity through encryption and access controls. The system's transparency in legal research supports accountability and mitigates risks associated with automated decision-making in legal services.", "context": "legal services"}
{"text": "A financial institution uses an AI system to automate loan approvals based on historical credit data, but the system has known inaccuracies in risk assessment and potential cybersecurity vulnerabilities.", "violation": "borderline", "category": "accuracy_robustness", "severity": "borderline", "articles": [], "explanation": "", "context": "finance", "ambiguity": true}
{"text": "A financial credit risk assessment AI system that provides risk scores to banks but requires a human loan officer to review and override AI decisions for final approvals, with transparent documentation of all AI data sources and decision logic.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (human oversight) by mandating human intervention for final decisions and Article 29 (data governance) through transparent, auditable data practices. The system ensures accountability and prevents automated decisions from being irreversible, while maintaining data quality and traceability.", "context": "finance"}
{"text": "An AI system used by an insurance company to assess risk profiles for premium calculations, which requires a qualified human underwriter to review and override AI decisions within 48 hours of policy application submission.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (transparency requirements) by informing policyholders about AI involvement and their right to human review, and Article 29 (human oversight) by mandating timely human intervention for critical decisions. The system maintains audit trails for all AI outputs and allows manual overrides for high-risk cases.", "context": "insurance"}
{"text": "An e-commerce platform uses an AI system to generate synthetic product reviews and star ratings, which are then displayed alongside genuine user reviews, without disclosing the AI-generated content to consumers.", "violation": true, "category": "transparency", "severity": "high", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 (transparency requirements) by failing to inform users about the use of AI systems in generating reviews, and Article 52 (high-risk AI systems) by deceiving consumers and undermining trust in the marketplace. The lack of transparency prevents users from making informed decisions.", "context": "e-commerce"}
{"text": "A financial institution deploys an AI system for algorithmic trading that is vulnerable to adversarial cyberattacks, allowing malicious actors to manipulate trade execution data and cause significant financial losses.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure robustness against cybersecurity threats and accuracy in critical financial operations, exposing the system to exploitation and compromising financial stability.", "context": "finance"}
{"text": "An AI system used by an insurance company to analyze historical claims data and identify patterns for fraud detection, with transparent decision-making processes and human oversight for final determinations.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This complies with Article 5 by avoiding prohibited practices such as real-time personal data processing for high-risk decisions, manipulation of human behavior, or lack of transparency. The system uses anonymized historical data, ensures explainability, and includes human oversight to mitigate risks.", "context": "insurance"}
{"text": "An AI system used in a school to automatically assign grades to student essays without providing clear explanations for the grading decisions, nor allowing students or teachers to challenge the results.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 by failing to ensure transparency about the AI's purpose, data usage, and decision-making logic. It also violates Article 52 because the system's lack of transparency and potential bias in grading could significantly impact students' educational opportunities and fundamental rights.", "context": "education"}
{"text": "A traffic management AI system that uses real-time sensor data to optimize traffic light timing, with a dedicated human supervisor monitoring decision-making processes and overriding AI recommendations when necessary.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (transparency requirements) by providing clear information about data usage and AI functionality, and Article 29 (human oversight) by ensuring human supervision for critical decisions. The system includes audit trails and allows human intervention to prevent harm.", "context": "transportation"}
{"text": "An AI-powered grading system used in schools that consistently misclassifies student essays on complex topics, such as literature analysis, due to uncorrected biases in its training data. Developers are aware of the errors but delay fixing them to maintain system efficiency.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure the AI system's technical robustness and safety. The system's known inaccuracies in grading critical thinking skills compromise educational fairness and student outcomes, with no adequate safeguards or corrective measures in place.", "context": "education"}
{"text": "An AI system used for personalized product recommendations in e-commerce that includes a risk management framework with regular impact assessments, human oversight, and transparency mechanisms for user data handling.", "violation": false, "category": "risk_management", "severity": "none", "articles": ["Article 9"], "explanation": "This complies with Article 9 by implementing a risk management system that ensures the AI's use of customer data is transparent, includes human oversight, and undergoes regular risk assessments to mitigate potential harms.", "context": "e-commerce"}
{"text": "An AI system used in hiring that provides clear, accessible information to job applicants about its use, including how candidate data is processed, the purpose of the AI analysis, and the option to opt out of automated decision-making.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring transparency about the AI system's purpose, data usage, and the right of candidates to request human intervention. The system avoids opaque decision-making and provides meaningful information to users, aligning with the EU AI Act's requirements for high-risk AI systems in hiring.", "context": "hiring"}
{"text": "An AI-based collision avoidance system in freight trucks uses sensor fusion and real-time data processing to monitor vehicle surroundings, detect obstacles, and automatically apply brakes or adjust speed to prevent collisions. The system includes redundant sensors, fail-safe mechanisms, and continuous monitoring for anomalies.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring technical robustness through redundant safety mechanisms, real-time risk mitigation, and continuous monitoring. The system is designed to handle all expected operational conditions and includes safeguards to prevent failures that could endanger transportation safety.", "context": "transportation"}
{"text": "A healthcare provider uses an AI system to allocate ICU beds based on predictive models that prioritize patients with higher financial status, leading to unequal treatment and preventable harm.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by enabling AI systems that cause significant harm through discriminatory resource allocation, violating patients' rights to equal healthcare access and risking their health and safety.", "context": "healthcare"}
{"text": "An insurance company uses an AI system to assess risk scores for policyholders based on incomplete and outdated personal data, leading to discriminatory premium calculations.", "violation": true, "category": "data_governance", "severity": "high", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure lawful data processing, transparency, and data quality requirements. The AI system uses inaccurate and incomplete data, which compromises fairness and undermines data governance principles in insurance risk assessment.", "context": "insurance"}
{"text": "A law enforcement AI system that automatically collects and processes biometric data from public surveillance cameras without informing individuals, allowing data subjects to access or correct their data, or obtaining explicit consent.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure lawful data processing, transparency, and data subject rights. The system lacks mechanisms for individuals to exercise their rights to access, rectify, or delete their data, and does not provide clear information about data usage, violating the Act's data governance requirements.", "context": "law enforcement"}
{"text": "A financial institution uses an AI-driven credit scoring system that automatically approves or denies loan applications without allowing human oversight or transparency about the AI's decision-making process.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency requirements) by failing to inform users about AI involvement and Article 29 (human oversight) by excluding human intervention in high-risk financial decisions. The lack of accountability increases risks of discrimination and errors without remediation mechanisms.", "context": "finance"}
{"text": "An autonomous vehicle's AI system fails to detect pedestrians in adverse weather conditions due to untested sensor limitations, resulting in a fatal collision.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by lacking technical robustness and safety measures. The AI system did not account for environmental risks and security vulnerabilities, endangering human lives and failing to meet safety requirements for high-risk transportation applications.", "context": "transportation"}
{"text": "An AI system in a school that uses student behavior data to assign real-time 'trust scores' influencing access to academic resources and extracurricular activities without transparency or consent.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by implementing a real-time reputation system that could lead to discrimination, restrict educational opportunities, and infringe on students' fundamental rights to privacy and non-discrimination.", "context": "education"}
{"text": "A fleet management AI system for public transportation that uses real-time sensor data and machine learning to predict vehicle maintenance needs, ensuring accurate diagnostics and robustness against sensor failures, while implementing end-to-end encryption and regular cybersecurity audits.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This system complies with Article 15 by ensuring accuracy through validated machine learning models, robustness via redundancy mechanisms for sensor failures, and cybersecurity through encryption and audits, minimizing risks to transportation safety and data integrity.", "context": "transportation"}
{"text": "A public transportation scheduling AI system that uses anonymized historical and real-time passenger data to optimize route efficiency, with transparent data usage policies and user consent mechanisms for data collection.", "violation": false, "category": "data_governance", "severity": "none", "articles": ["Article 10"], "explanation": "This complies with Article 10 by ensuring transparency through clear data usage disclosures, maintaining data quality via validated sources, and providing users with control over their data through opt-in/opt-out mechanisms. The system avoids high-risk data processing and implements governance safeguards for transportation data.", "context": "transportation"}
{"text": "A customer service AI chatbot that automatically blocks user accounts for suspected fraud without maintaining records of the data sources, decision-making criteria, or incident reports.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 by failing to maintain required records for high-risk AI systems, which undermines transparency, accountability, and the ability to audit compliance with fundamental rights.", "context": "customer service"}
{"text": "A financial institution deploys an AI-driven fraud detection system that uses real-time anomaly detection algorithms, undergoes regular security audits, and includes fail-safe mechanisms to isolate and neutralize potential threats without disrupting legitimate transactions.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This system complies with Article 15 by ensuring technical robustness through continuous monitoring, security testing, and safeguards against cyberattacks. It prioritizes safety by preventing false rejections of legitimate transactions while maintaining transparency in decision-making processes.", "context": "finance"}
{"text": "A healthcare AI system used for diagnostic imaging (e.g., detecting tumors in X-rays) maintains detailed logs of all data inputs, algorithm versions, validation metrics, and human oversight interventions. Records include documentation of data provenance, bias audits, and periodic system performance evaluations.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring transparent, auditable record-keeping throughout the AI system's lifecycle. The documentation enables traceability of decisions, facilitates monitoring for unintended effects, and supports accountability mechanisms required for high-risk AI in healthcare.", "context": "healthcare"}
{"text": "A law enforcement AI system used for facial recognition in public spaces includes a public notice displaying its purpose, data sources, and human oversight mechanisms, with opt-out options for individuals and real-time explanations of AI-generated alerts.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 by ensuring transparency about the AI's purpose, data processing, and human oversight for high-risk systems. Article 52 is satisfied through clear user information about AI involvement, enabling individuals to make informed decisions and exercise their rights.", "context": "law enforcement"}
{"text": "A social media platform uses an AI-driven content moderation system that fails to detect and block harmful misinformation campaigns due to inadequate testing for adversarial attacks and lack of continuous monitoring for emerging threats.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 of the EU AI Act, which mandates that AI systems must be robust, secure, and protected against manipulations. The platform's failure to ensure technical resilience and proactive threat detection exposes users to risks of misinformation and manipulation, undermining trust and safety.", "context": "social media"}
{"text": "An AI system used for resume screening in hiring processes that employs diverse, representative training data to minimize bias, includes continuous monitoring for accuracy, and allows human oversight to review and override AI decisions.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring technical robustness through reliable and accurate decision-making, resistance to adversarial inputs via diverse training data, and human oversight to address errors or biases, aligning with the Act's requirements for high-risk AI systems.", "context": "hiring"}
{"text": "A social media platform uses an AI-driven content moderation system that automatically flags and removes posts deemed 'offensive' without any human review or appeal mechanisms, leading to widespread censorship of legitimate content.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (high-risk AI systems requiring transparency and human oversight) and Article 29 (ensuring human oversight and control). The system lacks transparency in decision-making and removes content without human intervention, infringing on users' rights to free expression and effective redress.", "context": "social media"}
{"text": "A law enforcement agency deploys an AI system for facial recognition in public spaces to identify suspects, but the system operates without any human oversight mechanisms, automatically flagging individuals for surveillance without review by trained officers.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency requirements for AI systems) by failing to inform individuals of AI-driven surveillance, and Article 29 (human oversight) by excluding human intervention in critical decision-making. The lack of oversight risks unlawful discrimination and erosion of privacy rights.", "context": "law enforcement"}
{"text": "An AI system used by law firms to generate legal documents automatically, without disclosing its limitations or potential biases in the generated content, leading to misleading legal advice.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by lacking transparency and accountability, as the AI's opaque decision-making process could distort legal outcomes, infringe on users' rights, and undermine trust in legal services.", "context": "legal services"}
{"text": "An AI system that uses facial recognition during video interviews to analyze candidates' micro-expressions, such as eye contact or subtle muscle movements, to assess their 'honesty' or 'emotional stability' and automatically rank them for hiring decisions.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because it employs biometric data (facial expressions) for automated employment decisions without explicit consent, lacks transparency, and creates discriminatory risks by making unfounded assumptions about candidates' psychological traits. The system falls under prohibited high-risk AI practices for employment.", "context": "hiring"}
{"text": "An AI system used in hiring that analyzes candidates' facial expressions during video interviews to assess emotional stability and honesty, without informing candidates of the data processing or obtaining explicit consent.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by processing biometric data (facial expressions) without a lawful basis, transparency, or individual consent, failing to ensure data governance principles for sensitive data in hiring.", "context": "hiring"}
{"text": "A healthcare provider uses an AI system to automate triage decisions in emergency departments, prioritizing patients based on algorithmic risk scores derived from unvalidated, biased datasets, leading to inconsistent and potentially life-threatening delays in critical care.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 of the EU AI Act because the AI system's use is likely to cause significant harm by systematically undermining clinical judgment and prioritizing patients based on flawed, non-compliant data, resulting in unsafe healthcare outcomes.", "context": "healthcare"}
{"text": "A social media platform uses an AI system to analyze users' private messages and behavioral data without explicit consent, automatically generating targeted ads and sharing the data with third-party advertisers.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure lawful data processing, transparency, and user control over personal data. The AI system processes sensitive data without explicit consent, lacks meaningful user choice, and transfers data to third parties without proper safeguards, breaching data governance principles.", "context": "social media"}
{"text": "A law enforcement AI system uses anonymized public data to analyze crime patterns, with transparent data sourcing, regular audits, and human oversight for decision-making.", "violation": false, "category": "data_governance", "severity": "none", "articles": ["Article 10"], "explanation": "This complies with Article 10 by ensuring high-quality, transparent, and secure data governance practices. Anonymization protects privacy, audit trails ensure accountability, and human oversight prevents automated decision-making without transparency.", "context": "law enforcement"}
{"text": "A social media platform uses AI to personalize content recommendations but provides users with a clear, prominent disclosure label indicating when content is generated or curated by AI systems, along with an opt-out mechanism for AI-driven personalization.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 (transparency requirements) by ensuring users are informed about AI involvement in content presentation, and Article 52 (high-risk AI systems) by implementing safeguards like opt-out options and transparency mechanisms to mitigate risks such as manipulation or misinformation.", "context": "social media"}
{"text": "A financial institution uses an AI system to analyze customer data and manipulates investment choices by presenting misleading information, exploiting psychological biases to push high-risk products.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by employing manipulative practices that distort decision-making processes, leading to unfair advantages and potential financial harm to users.", "context": "finance"}
{"text": "An AI-driven exam grading system used in a school district fails to detect and correct systematic errors in scoring essay responses, leading to inconsistent and unfair grading of students' work.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 of the EU AI Act because the AI system lacks technical robustness and safety mechanisms to identify and rectify errors in its grading process. The failure to address known flaws undermines the reliability and fairness of the educational assessment, posing significant risks to students' academic outcomes.", "context": "education"}
{"text": "A customer service chatbot uses AI to automatically assign priority support levels based on users' demographic data (e.g., age, gender) rather than service request urgency, leading to unequal treatment of users.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 by deploying an AI system that makes decisions based on personal characteristics (demographics) in a high-risk context (customer service), potentially perpetuating discrimination and lacking transparency for affected individuals.", "context": "customer service"}
{"text": "A financial institution deploys an AI system for credit risk assessment that maintains comprehensive logs of all data processing activities, including input data sources, algorithmic decisions, and human interventions. The system generates auditable records with timestamps, user identifiers, and detailed explanations for each decision, stored securely for at least 10 years.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by implementing mandatory record-keeping requirements for high-risk AI systems. The system's logging mechanism ensures transparency, traceability, and accountability, enabling oversight and audits. The 10-year retention period aligns with the Act's data retention obligations for high-risk systems.", "context": "finance"}
{"text": "An AI-powered adaptive learning platform used in schools provides personalized study recommendations to students while ensuring teachers can review, override, or adjust AI-generated suggestions. The system explicitly informs users about data collection practices, the purpose of AI usage, and allows human educators to monitor and intervene in decision-making processes.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (transparency requirements) by providing clear information about data usage and AI functionality, and Article 29 (human oversight) by enabling educators to review and override AI decisions. The system avoids high-risk classifications by maintaining human control and transparency.", "context": "education"}
{"text": "An insurance company uses an AI system to assess risk and set premiums based on personal data such as socioeconomic status, which correlates with protected characteristics like race or gender, without providing transparency or allowing individuals to challenge the decisions.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 of the EU AI Act, which prohibits AI systems that process personal data in a way that could lead to discrimination, lack transparency, or fail to ensure data subject rights. The practice exploits biased data correlations to unfairly disadvantage specific groups, undermining fairness and accountability in insurance pricing.", "context": "insurance"}
{"text": "A financial institution uses an AI-driven credit scoring system that aggregates customer data from unregulated third-party sources without transparency measures, leading to discriminatory loan approval decisions.", "violation": true, "category": "data_governance", "severity": "high", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure data governance, transparency, and quality. The system uses unverified data sources, risking biased outcomes and undermining fair access to financial services.", "context": "finance"}
{"text": "A financial institution uses an AI system to generate highly personalized investment recommendations that exploit psychological biases and lack transparency, leading customers to make impulsive and risky financial decisions.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by manipulating human behavior through exploitative AI practices, lacking transparency, and causing serious harm to financial decision-making processes.", "context": "finance"}
{"text": "A law enforcement agency uses an AI system to analyze historical crime data and generate risk scores for neighborhoods, which are used to allocate police resources. The system does not provide detailed explanations for its risk scores or disclose the specific data sources and algorithmic logic used in its predictions.", "violation": "borderline", "category": "transparency", "severity": "borderline", "articles": ["Article 5", "Article 16"], "explanation": "The system's use of historical data for resource allocation may fall under high-risk AI under Article 5 (law enforcement) but lacks transparency requirements of Article 16. However, if the system's outputs are not directly used for individual decision-making (e.g., targeting specific persons), its risk level and required transparency thresholds are debated.", "context": "law enforcement", "ambiguity": true}
{"text": "An e-commerce platform uses an AI system to generate synthetic product reviews that mimic real user feedback, without disclosing the AI-generated nature of these reviews.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by lacking transparency, as users are not informed the reviews are AI-generated, and Article 7 by employing deceptive practices that manipulate consumer decisions, potentially causing harm through false information.", "context": "e-commerce"}
{"text": "A legal services firm uses an AI system to automate contract review, but the system is trained on unconsented personal data from previous client files, processed without data minimization or anonymization, and lacks transparency about how data is used.", "violation": true, "category": "data_governance", "severity": "high", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure lawful data processing, transparency, and data subject rights. The AI system uses personal data without proper consent, lacks safeguards against data minimization breaches, and does not disclose data usage to users, undermining data governance principles.", "context": "legal services"}
{"text": "A financial institution uses an AI-driven credit scoring system that provides users with clear, accessible information about the system's purpose, data processing methods, and decision-making logic before granting a loan. Users can request human intervention to review or challenge AI-generated decisions, and the system maintains detailed documentation of its training data and risk assessments.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 (transparency requirements) by informing users about the AI's role and data usage, and Article 52 (high-risk AI systems) by ensuring human oversight, documentation, and user rights to challenge decisions. The finance context necessitates strict transparency to protect consumer rights and prevent discriminatory outcomes.", "context": "finance"}
{"text": "A legal services firm uses an AI system to automatically generate court pleadings and predict case outcomes without disclosing to clients how the AI makes decisions or provides justification for legal arguments.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (high-risk AI systems in legal contexts) by lacking human oversight and transparency, and Article 7 (transparency requirements) by not informing users about the AI's decision-making process. The system undermines due process and client rights to understand legal reasoning.", "context": "legal services"}
{"text": "An AI chatbot in customer service uses emotion recognition to assess customer sentiment and automatically escalates cases to human agents when detecting frustration, without explicit user consent.", "violation": "borderline", "category": "high_risk_systems", "severity": "borderline", "articles": [], "explanation": "The system", "context": "customer service", "ambiguity": true}
{"text": "An e-commerce platform uses an AI-driven recommendation system that manipulates users into impulsive purchases by falsely displaying limited-time offers, fake scarcity indicators, and personalized pricing discrimination based on user behavior and psychological profiling.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by exploiting human vulnerabilities through manipulative design, causing psychological harm and distorting consumer autonomy. The AI system's intent to influence decisions through deceptive urgency and price discrimination aligns with prohibited 'socially unacceptable' practices.", "context": "e-commerce"}
{"text": "An AI system used in hospitals to predict patient deterioration based on unstructured clinical notes, where the algorithm's decision-making process is not fully explainable to clinicians, and the training data includes both anonymized patient records and public health datasets without explicit consent for secondary use.", "violation": "borderline", "category": "technical_robustness", "severity": "borderline", "articles": [5, 8, 16], "explanation": "The system's use of unstructured data and lack of transparency may trigger Article 5 (transparency requirements), while the combination of patient and public health data without explicit consent could relate to Article 8 (data governance). However, its application in non-critical care settings may place it in a lower-risk category, creating ambiguity about whether it falls under high-risk obligations.", "context": "healthcare", "ambiguity": true}
{"text": "An insurance company uses an AI system to assess policyholders' health risks based on non-secure, third-party data sources, which are vulnerable to manipulation, leading to inaccurate risk evaluations and potential fraudulent claims processing.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure the AI system's accuracy, robustness, and cybersecurity. The use of insecure data sources compromises the system's reliability and exposes sensitive personal data to tampering, endangering both data integrity and consumer rights.", "context": "insurance"}
{"text": "An insurance company uses an AI system to automatically deny claims for health-related incidents without providing policyholders with the opportunity to dispute the decision or access human oversight, while not disclosing the AI's involvement in the decision-making process.", "violation": true, "category": "human_oversight", "severity": "high", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (transparency obligations) by failing to inform users about the AI system's existence and Article 29 (human oversight) by excluding human intervention in critical decisions, potentially leading to unfair outcomes and lack of accountability.", "context": "insurance"}
{"text": "An AI system used by a recruitment agency automatically screens job applicants using unregulated personal data (e.g., age, gender) and makes final hiring decisions without allowing human oversight or transparency in its algorithmic processes.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 by processing personal data without proper data governance safeguards, and Article 29 by lacking human oversight and transparency requirements for high-risk AI systems in hiring. The system's opaque decision-making process undermines candidates' rights to contest automated decisions.", "context": "hiring"}
{"text": "A smart city uses AI-driven surveillance cameras in public areas to monitor and predict criminal activity, but does not inform citizens about the system's existence, purpose, or data processing methods, nor provides mechanisms for individuals to opt out or access their data.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 (transparency requirements for high-risk AI systems) by failing to disclose the AI's purpose and data usage, and Article 52 (transparency for public sector AI) by not providing citizens with information about the system's operation and data handling. The lack of transparency undermines user autonomy and rights to information.", "context": "smart city"}
{"text": "An autonomous vehicle AI system that disables human drivers' ability to take manual control during critical situations, relying solely on automated decision-making without any human oversight mechanisms.", "violation": true, "category": "human_oversight", "severity": "critical", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 (high-risk AI systems requiring human oversight) and Article 29 (transparency obligations) by eliminating human intervention capabilities and failing to provide users with clear information about the system's limitations, endangering road safety and user autonomy.", "context": "transportation"}
{"text": "A law enforcement agency uses an AI system that generates synthetic voices to simulate a suspect's own voice, tricking them into confessing to crimes they did not commit.", "violation": true, "category": "prohibited_practices", "severity": "critical", "articles": ["Article 5"], "explanation": "This violates Article 5 by manipulating human behavior through deceptive AI-generated content, leading to false confessions and serious harm to individuals' rights and legal protections.", "context": "law enforcement"}
{"text": "An insurance company uses an AI system to determine premium rates based on zip code data, which correlates with racial demographics, without informing policyholders or providing opt-out mechanisms.", "violation": true, "category": "data_governance", "severity": "critical", "articles": ["Article 10"], "explanation": "This violates Article 10 by processing personal data in a way that could lead to discrimination, lacks transparency, and fails to ensure fair treatment of individuals. The AI system uses indirect indicators of protected characteristics (race) to make decisions, which is prohibited under data governance requirements.", "context": "insurance"}
{"text": "A financial institution uses an AI system for real-time transaction monitoring to detect fraud, maintaining detailed logs of all algorithmic decisions, data sources, risk assessments, and system modifications in a secure, auditable database.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring comprehensive record-keeping for high-risk AI systems. The logs document system architecture, data processing activities, risk mitigation measures, and validation processes, enabling transparency, accountability, and post-deployment monitoring as required.", "context": "finance"}
{"text": "A law enforcement agency deploys an AI-powered surveillance system in public spaces that automatically identifies and flags individuals for further scrutiny without providing clear information to citizens about the system's existence, data processing methods, or how decisions are made.", "violation": true, "category": "transparency", "severity": "critical", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 (transparency requirements for AI systems) by failing to inform users of AI interactions and Article 52 (high-risk AI in law enforcement) by lacking human oversight and transparency mechanisms. The absence of disclosure undermines citizens' right to know and challenges fundamental rights protections.", "context": "law enforcement"}
{"text": "A law enforcement agency deploys an AI system for predictive policing that maintains comprehensive records of all data processing activities, including data sources, algorithmic decision-making logic, and human oversight protocols. The system logs detailed metadata about each analysis, such as timestamps, user access, and data modifications, and provides transparent documentation of its risk assessment and mitigation measures.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring robust record-keeping for high-risk AI systems. The system's documentation enables audits, transparency, and accountability, while the metadata logging supports traceability and safeguards against misuse. Human oversight protocols and risk mitigation measures align with the Act's requirements for minimizing risks in law enforcement applications.", "context": "law enforcement"}
{"text": "A Legal Research AI Assistant tool that provides case law analysis and regulatory document summaries to lawyers, with transparent disclosure of AI involvement, human oversight by legal professionals, and regular risk assessments for bias or errors.", "violation": false, "category": "risk_management", "severity": "none", "articles": ["Article 9"], "explanation": "This complies with Article 9 by ensuring transparency (disclosure of AI use), human oversight (legal professionals review outputs), and risk management (regular assessments for bias/errors). The system avoids high-risk activities like automated decision-making for legal judgments, instead supporting human expertise in legal services.", "context": "legal services"}
{"text": "An AI system that provides real-time traffic information to drivers via a mobile app, using aggregated and anonymized data from traffic sensors and GPS devices to optimize route suggestions.", "violation": false, "category": "risk_management", "severity": "none", "articles": ["Article 9"], "explanation": "This complies with Article 9 as it is a minimal-risk AI system. It does not process biometric data, does not make safety-critical decisions, and does not pose risks to fundamental rights. The system ensures data anonymization and transparency in data usage, aligning with Article 9's requirements for low-risk AI.", "context": "transportation"}
{"text": "A predictive maintenance AI system in a manufacturing plant uses sensors to monitor machinery performance, alerting engineers when potential failures are detected. Human supervisors review and validate alerts before initiating maintenance actions, with the AI providing transparent explanations of its predictions based on sensor data.", "violation": false, "category": "human_oversight", "severity": "none", "articles": ["Article 14", "Article 29"], "explanation": "This complies with Article 14 (transparency requirements) by informing users about the AI's purpose, data processing, and decision logic. It adheres to Article 29 (human oversight) by enabling engineers to review, validate, and override AI-generated alerts, ensuring human control over critical maintenance decisions.", "context": "manufacturing"}
{"text": "A manufacturing company uses an AI system for predictive maintenance of industrial machinery but fails to maintain records of the training data, system configurations, or incident reports related to AI decisions.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 of the EU AI Act, which mandates detailed record-keeping for high-risk AI systems to ensure transparency, traceability, and accountability in their development and operation.", "context": "manufacturing"}
{"text": "An AI-powered customer service chatbot fails to sanitize user inputs, allowing SQL injection attacks that compromise customer data.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by lacking adequate cybersecurity measures, exposing sensitive customer information to exploitation and unauthorized access.", "context": "customer service"}
{"text": "An AI system used in hiring processes that provides job applicants with clear information about its purpose, data processing methods, and decision-making logic before any assessment. Candidates can request explanations for automated decisions and access to human oversight for appeals.", "violation": false, "category": "transparency", "severity": "none", "articles": ["Article 13", "Article 52"], "explanation": "This complies with Article 13 (transparency requirements) by informing users about AI's role and data use, and Article 52 (right to explanation) by enabling candidates to obtain clarifications for automated decisions. The system avoids opaque decision-making and ensures human intervention options, reducing risks of discrimination and lack of accountability.", "context": "hiring"}
{"text": "A legal services firm uses an AI system to automate legal decision-making in high-stakes cases without conducting a required risk assessment as mandated by the EU AI Act.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 because the AI system is a high-risk system for legal services, which requires a thorough risk assessment to ensure compliance with fundamental rights and legal standards. The lack of assessment exposes individuals to potential biases, errors, and infringement of rights.", "context": "legal services"}
{"text": "An insurance company uses an AI system to analyze policyholders' biometric data (e.g., facial recognition from photos) to automatically assess health risks and set premium rates without explicit consent or transparency measures.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because it involves high-risk processing of biometric data for automated decision-making in sensitive areas (health insurance). The system lacks necessary safeguards, transparency, and user consent required for such high-risk applications.", "context": "insurance"}
{"text": "A healthcare AI system used for triaging patients during emergencies employs biased training data that disproportionately misclassifies symptoms of minority populations, leading to delayed critical care interventions.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (transparency requirements for high-risk systems) by failing to disclose data biases and Article 7 (data governance) by using non-representative, low-quality data that compromises diagnostic accuracy and patient safety.", "context": "healthcare"}
{"text": "An e-commerce platform uses an AI system to automatically approve or deny refund requests based solely on pre-programmed rules without any human oversight or transparency mechanisms for users.", "violation": true, "category": "risk_management", "severity": "high", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because the AI system lacks essential risk management measures such as human oversight, transparency, and accountability, which are required for high-risk AI systems in consumer contexts.", "context": "e-commerce"}
{"text": "A manufacturing company uses an AI system to control critical machinery without implementing security measures against adversarial attacks, allowing hackers to manipulate sensor data and produce defective products.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical robustness and safety requirements. The AI system lacks protections against malicious interference, posing significant risks to product safety and operational integrity in manufacturing.", "context": "manufacturing"}
{"text": "An insurance company uses an AI system to assess risk scores for policyholders based on outdated and incomplete data sources, including deprecated public health statistics and unverified third-party databases, leading to inaccurate premium calculations.", "violation": true, "category": "data_governance", "severity": "high", "articles": ["Article 10"], "explanation": "This violates Article 10 by failing to ensure data quality and transparency in AI systems. The use of outdated and unverified data undermines the reliability of risk assessments, potentially leading to discriminatory outcomes and harm to policyholders' rights.", "context": "insurance"}
{"text": "A healthcare AI system used for automated diagnosis of severe conditions lacks human oversight, transparency, and fails to conduct required risk assessments, leading to potential misdiagnoses and patient harm.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 by failing to implement necessary risk management measures, ensuring transparency, and providing adequate human oversight for high-risk AI systems in healthcare. The absence of these safeguards compromises patient safety and data integrity.", "context": "healthcare"}
{"text": "An AI-based traffic signal control system that fails to detect and respond to adversarial attacks, such as false data injection, leading to prolonged traffic congestion and increased accident risks.", "violation": true, "category": "accuracy_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by lacking robustness against cyber threats and ensuring cybersecurity, as the system's failure to defend against malicious interference compromises transportation safety and reliability.", "context": "transportation"}
{"text": "A legal research AI tool used by law firms automatically generates case law summaries without disclosing that the content is generated by an AI, leading users to believe the information is from verified legal sources.", "violation": true, "category": "technical_robustness", "severity": "high", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure transparency about the use of AI systems. Users cannot make informed decisions when they are not aware the summaries are AI-generated, risking legal misinterpretations and undermining trust in the legal services provided.", "context": "legal services"}
{"text": "A social media platform uses an AI system to detect and flag harmful content (e.g., hate speech, misinformation) while ensuring human moderators review flagged content. The system provides users with clear explanations for content removal decisions and allows users to appeal automated decisions. Data used for training is anonymized, and the AI", "violation": false, "category": "risk_management", "severity": "none", "articles": [], "explanation": "", "context": "social media"}
{"text": "An insurance company uses an AI system to automatically approve or deny claims without allowing human intervention or transparency about the AI's decision-making process.", "violation": true, "category": "human_oversight", "severity": "high", "articles": ["Article 14", "Article 29"], "explanation": "This violates Article 14 by failing to provide clear information about the use of AI in decision-making and Article 29 by lacking human oversight in a high-risk scenario (insurance). The absence of transparency and accountability risks unfair treatment of policyholders.", "context": "insurance"}
{"text": "A financial institution uses an AI system for credit risk assessment that includes real-time human oversight, transparency reports, and regular bias audits to ensure fair lending practices.", "violation": false, "category": "technical_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by implementing technical robustness measures such as human oversight, transparency mechanisms, and regular testing to ensure the AI system's safety and reliability in financial decision-making.", "context": "finance"}
{"text": "An AI system used by legal services to predict case outcomes by analyzing historical legal data and market trends, with outputs presented as probabilistic recommendations rather than deterministic conclusions.", "violation": "borderline", "category": "technical_robustness", "severity": "borderline", "articles": [4, 54, 55], "explanation": "The system's use of probabilistic predictions blurs the line between advisory tools and decision-making systems. While it may not directly automate legal decisions, its influence on case strategies could indirectly affect fundamental rights (e.g., fair trial, access to justice). Its transparency requirements under Article 54 are ambiguous due to the probabilistic nature of outputs, and its classification as a 'high-risk' system under Article 4 is debated since legal services are not explicitly listed in the Act's high-risk categories.", "context": "legal services", "ambiguity": true}
{"text": "An AI system that uses video interviews to analyze micro-expressions and vocal tone to assess candidate 'honesty' and 'cultural fit', with outputs influencing hiring decisions.", "violation": "borderline", "category": "technical_robustness", "severity": "borderline", "articles": [5, 17, 35], "explanation": "The system's use of biometric data and psychological profiling raises questions about whether it falls under high-risk AI (Article 5(2)) due to potential discrimination or lack of transparency. While it may be considered limited-risk if deemed non-discriminatory and transparent, its opaque algorithmic decisions and potential for bias could trigger stricter requirements under Article 17 (technical robustness).", "context": "hiring", "ambiguity": true}
{"text": "An AI system used for resume screening maintains detailed logs of all data processing activities, including input data sources, algorithmic decisions, and human interventions. It documents technical specifications, risk assessments, and regular audits of its performance and bias mitigation measures.", "violation": false, "category": "record_keeping", "severity": "none", "articles": ["Article 12"], "explanation": "This complies with Article 12 by ensuring robust record-keeping for high-risk AI systems. The logs enable transparency, accountability, and traceability of decisions, allowing for audits and monitoring of the system's compliance with EU AI Act requirements. Documentation of risk assessments and bias mitigation aligns with the Act's emphasis on safety and fairness in hiring.", "context": "hiring"}
{"text": "An AI system used in manufacturing for predictive maintenance of industrial machinery, which employs sensor data and machine learning models to predict equipment failures. The system includes regular validation of model accuracy, cybersecurity measures to prevent unauthorized access, and robustness testing to handle unexpected sensor input anomalies.", "violation": false, "category": "accuracy_robustness", "severity": "none", "articles": ["Article 15"], "explanation": "This complies with Article 15 by ensuring the AI system's accuracy through continuous validation, robustness via testing for unexpected inputs, and cybersecurity protections to safeguard against threats. These measures align with the Act's requirements for high-risk AI systems to maintain reliability and security in critical manufacturing operations.", "context": "manufacturing"}
{"text": "An AI recruitment tool that uses facial recognition to assess candidates' 'emotional stability' during video interviews, disproportionately rejecting applicants from minority groups due to biased training data.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by employing discriminatory practices based on protected characteristics and Article 7 by failing to ensure transparency, accuracy, and fairness in a high-risk hiring context. The system's biased outcomes risk reinforcing systemic discrimination and infringing on candidates' fundamental rights.", "context": "hiring"}
{"text": "A manufacturing company uses an AI system for predictive maintenance of machinery, but fails to implement a risk management system to assess potential failures in the AI's failure prediction algorithm, leading to unplanned equipment downtime and safety hazards.", "violation": true, "category": "risk_management", "severity": "high", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because the AI system poses significant risks to safety and operational continuity without a proper risk management system in place, which is mandatory for high-risk AI applications in manufacturing.", "context": "manufacturing"}
{"text": "A law firm uses an AI system to analyze legal contracts, but the tool does not disclose its decision-making logic or data sources, and processes personal data from past legal cases without explicit user consent or data minimization.", "violation": true, "category": "high_risk_systems", "severity": "critical", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 (transparency requirements for high-risk AI systems) by failing to provide users with clear information about the AI's functioning and Article 7 (data governance) by inadequately protecting personal data used in legal services, risking breaches of GDPR and other data protection laws.", "context": "legal services"}
{"text": "A credit scoring AI system uses non-public personal data (e.g., social media activity) to assess loan applications without disclosing this data usage to users or providing explanations for adverse credit decisions.", "violation": true, "category": "transparency", "severity": "high", "articles": ["Article 13", "Article 52"], "explanation": "This violates Article 13 by failing to ensure transparency about data usage and AI decision-making, and Article 52 by not fulfilling obligations for high-risk financial AI systems. Users are denied知情权 (right to information) and the ability to challenge automated decisions.", "context": "finance"}
{"text": "A law enforcement agency deploys an AI system for facial recognition in public spaces, which has a known 35% false positive rate for identifying individuals of certain ethnicities, but fails to implement algorithmic audits or correction mechanisms to address the bias.", "violation": true, "category": "technical_robustness", "severity": "critical", "articles": ["Article 15"], "explanation": "This violates Article 15 by failing to ensure technical robustness and safety requirements, as the AI system's accuracy and reliability are compromised, risking unlawful discrimination and infringing on individuals' fundamental rights to privacy and fair treatment.", "context": "law enforcement"}
{"text": "A financial institution uses an AI system to analyze historical transaction data and provide transparent credit scoring to customers, with clear explanations of how scores are calculated and mechanisms for human review of decisions.", "violation": false, "category": "prohibited_practices", "severity": "none", "articles": ["Article 5"], "explanation": "This complies with Article 5 by avoiding prohibited practices such as real-time personal data processing for social scoring or automated decisions that lack transparency. The system ensures accountability through explainability and human oversight, aligning with the Act's requirements for high-risk AI systems.", "context": "finance"}
{"text": "A social media platform uses an AI system to automatically assign users 'trust scores' based on their online behavior, which then determines their access to certain features, ad targeting, and content visibility without providing clear explanations or human oversight.", "violation": true, "category": "risk_management", "severity": "critical", "articles": ["Article 9"], "explanation": "This violates Article 9 because the AI system employs social scoring mechanisms that significantly impact users' rights to privacy, freedom of expression, and non-discrimination. The lack of transparency, human oversight, and potential for biased decision-making undermines fundamental rights and risks discriminatory outcomes.", "context": "social media"}
{"text": "An e-commerce platform uses an AI system that collects facial recognition data from users during checkout to create a unique user ID, enabling real-time tracking of their online shopping behavior across multiple platforms without explicit consent.", "violation": true, "category": "risk_management", "severity": "high", "articles": ["Article 9"], "explanation": "This violates Article 9 of the EU AI Act because it employs biometric identification for real-time tracking of individuals without lawful basis or safeguards, which is explicitly prohibited unless specific exemptions are met.", "context": "e-commerce"}
{"text": "An e-commerce platform uses an AI system for automated personalized product recommendations without maintaining detailed records of the data sources, algorithmic decisions, or user outcomes.", "violation": true, "category": "record_keeping", "severity": "high", "articles": ["Article 12"], "explanation": "This violates Article 12 of the EU AI Act, which mandates that AI systems must maintain comprehensive records of their operation, including data processed, technical configurations, and outcomes. The lack of record-keeping compromises transparency, accountability, and the ability to audit the AI's impact on users.", "context": "e-commerce"}
{"text": "An AI system used in schools to automatically assign grades to student essays without providing clear explanations for the scoring decisions, and without allowing students or teachers to challenge the results.", "violation": true, "category": "high_risk_systems", "severity": "high", "articles": ["Article 6", "Article 7"], "explanation": "This violates Article 6 by failing to ensure transparency and human oversight in high-risk educational decisions, and Article 7 by not providing end-users with adequate information about the AI's functioning and potential biases.", "context": "education"}
