{
  "model_type": "distilbert",
  "name": "distilbert-base-uncased-finetuned-policy-detection",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "status": "placeholder - pending actual model training",
  "id2label": {
    "0": "COMPLIANT",
    "1": "NON_COMPLIANT"
  },
  "label2id": {
    "COMPLIANT": 0,
    "NON_COMPLIANT": 1
  }
}
