{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "PII-DATE",
    "2": "PII-EMAIL",
    "3": "PII-FINANCIAL",
    "4": "PII-GOVERNMENT_ID",
    "5": "PII-IP_ADDRESS",
    "6": "PII-LOCATION",
    "7": "PII-ORGANIZATION",
    "8": "PII-PERSON",
    "9": "PII-PHONE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "O": 0,
    "PII-DATE": 1,
    "PII-EMAIL": 2,
    "PII-FINANCIAL": 3,
    "PII-GOVERNMENT_ID": 4,
    "PII-IP_ADDRESS": 5,
    "PII-LOCATION": 6,
    "PII-ORGANIZATION": 7,
    "PII-PERSON": 8,
    "PII-PHONE": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
